# St7SetSolverNonlinearGeometry

Sets the state of the Nonlinear Geometry option for nonlinear analyses.

long St7SetSolverNonlinearGeometry(long uID, bool NonlinearGeometry)

Input Parameters

uID

Strand7 model file ID.

Solver – General

NonlinearGeometry

True to enable the Nonlinear Geometry option.